cf_billing/Catalogs/энргКомментарииКСудебномуДелу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКомментарииКСудебномуДелу</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дело</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргБанкротство</v8:Type>
						<v8:Type>cfg:DocumentRef.бестРегистрацияБанкротства</v8:Type>
						<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоОтчёта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебноеЗаседание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебнаяИнстанция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеИнстанции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗадачаПИДПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.энргРеструктуризацияЗадолженностиПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.энргСоглашениеПоРассрочкеПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргКомментарииКСудебномуДелу/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Перем МассивФайлов;
	
	Если ЗначениеЗаполнено(Дело) И ДополнительныеСвойства.Свойство("АдресаФайлов", МассивФайлов) Тогда
		Для каждого ТекФайл Из МассивФайлов Цикл
			РасширениеФайла  = Справочники.энргКомментарииКСудебномуДелу.ПолучитьРасширениеФайла(ТекФайл.Представление);
			ИмяБезРасширения = СтрЗаменить(ТекФайл.Представление, "." + РасширениеФайла, "");
			
			ДатаМодификацииФайла		= ТекущаяДатаСеанса();
			ПараметрыДобавляемогоФайла	= Новый Структура;
			ПараметрыДобавляемогоФайла.Вставить("ВладелецФайлов",	 			?(СудебноеЗаседание, Дело, Дело.СтартоваяЗадача));
			ПараметрыДобавляемогоФайла.Вставить("Автор",						Строка(ПараметрыСеанса.ТекущийПользователь));
			ПараметрыДобавляемогоФайла.Вставить("ИмяБезРасширения",				ИмяБезРасширения);
			ПараметрыДобавляемогоФайла.Вставить("РасширениеБезТочки",			РасширениеФайла);
			ПараметрыДобавляемогоФайла.Вставить("ВремяИзменения",				МестноеВремя(ДатаМодификацииФайла, ЧасовойПоясСеанса()));
			ПараметрыДобавляемогоФайла.Вставить("ВремяИзмененияУниверсальное",	ДатаМодификацииФайла);
			НовФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыДобавляемогоФайла, 	ТекФайл.Значение);
			
			Если ЗначениеЗаполнено(НовФайл) Тогда
				СтрокаТЧ = Файлы.Добавить();
				СтрокаТЧ.Файл = НовФайл;              
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
